Webahh/embedded_signlanguage_translator/STM32N6570DK_LL/STM32N6570DK/FSBL/Src/Drivers/Simple/Inc/simple_camera.h
/**
 * @file    simple_camera.h
 * @brief   Top-level camera API
 *  Created on: May 29, 2026
 *      Author: Groß
 */

#ifndef SIMPLE_CAMERA_H
#define SIMPLE_CAMERA_H

#include "stm32n657xx.h"
#include "simple_dcmipp.h"
#include "simple_imx335.h"

#define CAM_PIPE_DISPLAY        DCMIPP_PIPE1
#define CAM_PIPE_NN             DCMIPP_PIPE2
#define CAM_CLIENT_NN           DCMIPP_CLIENT2
#define CAM_CLIENT_DISPLAY      DCMIPP_CLIENT5

// Display output width/Height  (pixels)
#define CAM_DISPLAY_WIDTH       800U
#define CAM_DISPLAY_HEIGHT      480U

/** NN input width/Height  (pixels) */
#define CAM_NN_WIDTH            192U
#define CAM_NN_HEIGHT           144U

/** NN inference buffer base address */
#define CAM_NN_BUF              0x34180000U


/** CAM function return codes */
typedef enum {
    CAM_OK         = 0, /**< Success */
    CAM_ERROR      = 1, /**< Unspecified error */
    CAM_ERROR_ID   = 2, /**< IMX335 Probe/ID read failed */
    CAM_ERROR_INIT = 3, /**< IMX335 initialisation failed */
} CAM_Status;

/** Top-level camera instance handle */
typedef struct {
    IMX335_Handle imx335;				/**< IMX335 sensor handle            */
    uint32_t      display_buf;			/**< Display buffer base address     */
    uint32_t      nn_buf;				/**< NN buffer base address          */
    int32_t       display_pitch;   		/**< Display pipe line pitch (bytes) */
    int32_t       nn_pitch;        		/**< NN pipe line pitch (bytes)      */
    uint8_t       initialized;     		/**< Non-zero after successful Init  */
} CAM_Handle;

/**
 * @brief  Initialise the entire camera subsystem.
 *
 * @param  h      Camera handle (output)
 * @param  nn_buf NN buffer base address (0 = use default CAM_NN_BUF)
 * @retval CAM_OK on success
 */
CAM_Status CAM_Init(CAM_Handle *h, uint32_t nn_buf);

/**
 * @brief  Start the display pipe and sensor streaming.
 *
 * @param  h Camera handle
 * @retval CAM_OK on success
 */
CAM_Status CAM_DisplayPipe_Start(CAM_Handle *h);

/**
 * @brief  Start the NN pipe (capture to nn_buf).
 * @param  h Camera handle
 * @retval CAM_OK on success
 */
CAM_Status CAM_NNPipe_Start(CAM_Handle *h);

#endif /* SIMPLE_CAMERA_H */
